#ifndef __Container__
#define __Container__
using namespace std;
#include <fstream>
//-------------------------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры 
// для представленной реализации контейнера не требуется
//-------------------------------------------------------------------------------------------------
struct Shape;

//-------------------------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
//-------------------------------------------------------------------------------------------------
struct Container
{
	// максимальная длина
	enum { max_len = 100 };

	// текущая длина
	int len;

	Shape *cont[max_len];
};

//-------------------------------------------------------------------------------------------------
// Заголовки функций
//-------------------------------------------------------------------------------------------------
void Init(Container &c);
void Clear(Container &c);

void In(Container &c, ifstream &in);
void Out(Container &c, ofstream &out);
void MultiMethod(Container &c, ofstream &out);

#endif