#ifndef __DiagArr__
#define __DiagArr__
using namespace std;
#include <fstream>
//-------------------------------------------------------------------------------------------------
// Прямоугольник
//-------------------------------------------------------------------------------------------------
struct DiagArr
{
	// ширина, высота
	int b[3];
	int Arr[3][3];
	char prov;
	bool perepoln;
};

//-------------------------------------------------------------------------------------------------
// Заголовки функций
//-------------------------------------------------------------------------------------------------
void In(DiagArr &r, ifstream &in);
void Out(DiagArr &r, ofstream &out);

#endif