#ifndef __Shape__
#define __Shape__

#include "DiagArr.h"
#include "QuadArr.h"

//-------------------------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
//-------------------------------------------------------------------------------------------------
struct Shape
{
	// значения ключей для каждой из фигур
	enum key { DIAGARR, QUADARR };

	// ключ
	key k;

	// используемые альтернативы, простейшая реализация
	union
	{
		DiagArr r;
		QuadArr t;
	};
};

//-------------------------------------------------------------------------------------------------
// Заголовки функций
//-------------------------------------------------------------------------------------------------
Shape *In(ifstream &in);
void Out(Shape &s, ofstream &out);

#endif