#include <fstream>
using namespace std;

#include "Container.h"
#include "Shape.h"

//-------------------------------------------------------------------------------------------------
// Инициализация контейнера
//-------------------------------------------------------------------------------------------------
void Init(Container &c) 
{
	c.len = 0;
}

//-------------------------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
//-------------------------------------------------------------------------------------------------
void Clear(Container &c)
{
	for(int i = 0; i < c.len; i++)
		delete c.cont[i];

	c.len = 0;
}

//-------------------------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
//-------------------------------------------------------------------------------------------------
void In(Container &c, ifstream &in)
{
	while(!in.eof())
		if((c.cont[c.len] = In(in)) != 0)
			c.len++;
}

//-------------------------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
//-------------------------------------------------------------------------------------------------
void Out(Container &c, ofstream &out)
{
	out << "Контейнер содержит " << c.len << " элементов." << endl;
	for(int i = 0; i < c.len; i++)
	{
		out << i << ": ";
		Out(*(c.cont[i]), out);
	}
}
