#ifndef __Shape__
#define __Shape__

#include "DiagArr.h"
#include "QuadArr.h"
<<<<<<< HEAD
=======
#include "TriagArr.h"
>>>>>>> v2

//-------------------------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
//-------------------------------------------------------------------------------------------------
struct Shape
{
	// значения ключей для каждой из фигур
<<<<<<< HEAD
	enum key {DIAGARR, QUADARR};
=======
	enum key {DIAGARR, QUADARR,TRIAGARR};
>>>>>>> v2

	// ключ
	key k;

	// используемые альтернативы, простейшая реализация
	union
	{
		DiagArr r;
		QuadArr t;
<<<<<<< HEAD
=======
		TriagArr w;
>>>>>>> v2
	};
};

//-------------------------------------------------------------------------------------------------
// Заголовки функций
//-------------------------------------------------------------------------------------------------
Shape *In(ifstream &in);
void Out(Shape &s, ofstream &out);

#endif